src/cf/DataProcessors/ГенерацияПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ГенерацияПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодарочныхСертификатов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантГенерацииПодарочныхСертификатов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиапазонНомераС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиапазонНомераПо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольУникальностиНомеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодарочныеСертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Documents/ВыпускПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВыпускПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 20.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияСтатусовПодарочныхСертификатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодарочныхСертификатов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодарочныеСертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/DataProcessors/ГенерацияПодарочныхСертификатов/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВариантГенерацииПодарочныхСертификатов = "с номерами в указанном диапазоне" Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("ДиапазонНомераС");
		Если Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("ДиапазонНомераС");
		КонецЕсли;
		
		Индекс = ПроверяемыеРеквизиты.Найти("ДиапазонНомераПо");
		Если Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("ДиапазонНомераПо");
		КонецЕсли;
	Иначе
		Индекс = ПроверяемыеРеквизиты.Найти("ДиапазонНомераС");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = ПроверяемыеРеквизиты.Найти("ДиапазонНомераПо");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция СгенерироватьПодарочныеСертификаты() Экспорт
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ВариантГенерацииПодарочныхСертификатов = "с номерами в указанном диапазоне" Тогда
		Если НЕ НомерСоответствуетШаблону(ДиапазонНомераС, ШаблонНомера) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нижняя граница диапазона номеров генерируемых сертификатов не соответствует установленному шаблону!'"), , "ДиапазонНомераС", "Объект");
			Возврат Ложь;
		КонецЕсли;
		
		Если НЕ НомерСоответствуетШаблону(ДиапазонНомераПо, ШаблонНомера) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Верхняя граница диапазона номеров генерируемых сертификатов не соответствует установленному шаблону!'"), , "ДиапазонНомераПо", "Объект");
			Возврат Ложь;
		КонецЕсли;
		
		Если ДиапазонНомераС > ДиапазонНомераПо Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нижняя граница диапазона номеров генерируемых сертификатов не может превышать верхнюю!'"), , "ДиапазонНомераС", "Объект");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Идея в том, что в случае, если номера в диапазоне начинаются с нуля (нулей), в числовой текущий номер
	//такие ведущие нули не попадают, но если прибавить к границам число с заведомо большей разрядностью, чем длина номера
	//сертификата и далее для таких очередных числовх значений номеров преобразовать к строке, то ведущие нули не потеряются
	Смещение = 10000000000000000000000000;
	
	Если ВариантГенерацииПодарочныхСертификатов = "с номерами в указанном диапазоне" Тогда
		НижняяГраницаДиапазонаЧислом = Число(СтрЗаменить(ДиапазонНомераС, " ", "")) + Смещение;
		ВерхняяГраницаДиапазонаЧислом = Число(СтрЗаменить(ДиапазонНомераПо, " ", "")) + Смещение;
	Иначе
		НижняяГраницаДиапазонаЧислом = 1 + Смещение;
		ВерхняяГраницаДиапазонаЧислом = Число(СтрЗаменить(ШаблонНомера, " ", "")) + Смещение;
	КонецЕсли;
	
	//Запомним строки табличной части, если придется откатываться (удалять) в случае ошибки
	СтрокиДобавленныхСертификатов = Новый Массив;
	
	НачатьТранзакцию();
	
	Попытка				
		ЗаблокироватьДанныеДляРедактирования(ВидПодарочныхСертификатов);
		
		НовыйДокумент = Документы.ВыпускПодарочныхСертификатов.СоздатьДокумент();
		
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.ВидПодарочныхСертификатов = ВидПодарочныхСертификатов;
		НовыйДокумент.Комментарий = Комментарий;
		НовыйДокумент.Ответственный = Ответственный;
		
		Для ТекущийНомерСертификатаЧислом = НижняяГраницаДиапазонаЧислом По ВерхняяГраницаДиапазонаЧислом Цикл
			НовыйЭлемент = Справочники.ПодарочныеСертификаты.СоздатьЭлемент();
			
			НовыйЭлемент.Владелец = ВидПодарочныхСертификатов;
			НовыйЭлемент.Код = ПолучитьНомерСертификатаСоответствующегоШаблону(ТекущийНомерСертификатаЧислом, ШаблонНомера);
			
			НовыйЭлемент.ДополнительныеСвойства.Вставить("КонтролироватьУникальностьПоВсемВидам", КонтрольУникальностиНомеров = "по всем видам сертификатов");
			НовыйЭлемент.Записать();
			
			НоваяСтрока = НовыйДокумент.ПодарочныеСертификаты.Добавить();
			НоваяСтрока.ПодарочныйСертификат = НовыйЭлемент.Ссылка;
			
			НоваяСтрока = ПодарочныеСертификаты.Добавить();
			НоваяСтрока.ПодарочныйСертификат = НовыйЭлемент.Ссылка;
			СтрокиДобавленныхСертификатов.Добавить(НоваяСтрока);
		КонецЦикла;
		
		НовыйДокумент.Сумма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидПодарочныхСертификатов, "НоминальнаяСтоимость") * НовыйДокумент.ПодарочныеСертификаты.Количество();
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
	Исключение
		ОтменитьТранзакцию();

		Информация = ИнформацияОбОшибке().Описание;
		ОбщегоНазначения.СообщитьПользователю(Информация);
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Подарочные сертификаты не сгенерированы'"));
		
		Для Каждого Строка Из СтрокиДобавленныхСертификатов Цикл 
			ПодарочныеСертификаты.Удалить(Строка);
		КонецЦикла;
		
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция НомерСоответствуетШаблону(Номер, Шаблон)
	Если СтрДлина(Номер) <> СтрДлина(Шаблон) Тогда
		Возврат Ложь;
	Иначе     
		Для Н = 1 По СтрДлина(Номер) Цикл
			ТекСимволНомера = Сред(Номер, Н, 1);
			ТекСимволШаблона = Сред(Шаблон, Н, 1);
			
			Если ТекСимволНомера <> ТекСимволШаблона И 
					(НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТекСимволНомера) И
					ТекСимволШаблона = "9" ИЛИ ТекСимволШаблона <> "9") Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;        
	
	Возврат Истина;
КонецФункции

Функция ПолучитьНомерСертификатаСоответствующегоШаблону(НомерСертификата, ШаблонНомера) Экспорт
	КоличествоЦифрВШаблоне = СтрДлина(СтрЗаменить(ШаблонНомера, " ", ""));
	
	ДлинаШаблона = СтрДлина(ШаблонНомера);
	СтрокаНулей = "";
	Для Н = 1 По ДлинаШаблона Цикл 
		СтрокаНулей = СтрокаНулей + "0";
	КонецЦикла;
	
	НомерСертификатаСтрокой = Прав(СтрокаНулей + Формат(НомерСертификата, "ЧГ="), КоличествоЦифрВШаблоне);
	
	Результат = "";
	НомерТекущегоЧисловогоСимволаШаблона = 0;
	
	Для Н = 1 По СтрДлина(ШаблонНомера) Цикл
		ТекСимволШаблона = Сред(ШаблонНомера, Н, 1);
		Если ТекСимволШаблона = " " Тогда
			Результат = Результат + " ";
		Иначе
			НомерТекущегоЧисловогоСимволаШаблона = НомерТекущегоЧисловогоСимволаШаблона + 1;
			Результат = Результат + Сред(НомерСертификатаСтрокой, НомерТекущегоЧисловогоСимволаШаблона, 1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
